  aaa();  
setInterval(function(){
      document.querySelector('table').innerHTML= '<table><tr><td class="he">時刻</td><td class="he">列車番号</td><td class="he">運用</td><td class="he">備考</td> </tr></table>'
        aaa();
    },1000)
function aaa(){

  
var data = [
  [1420,'T+GG',''],
[5422,'N+SS',''],
[5320,'E231(K/E233(E0','東京経由'],
[720,'N','沼津から5222'],
[322,'E231(K/E233(E0','東京経由'],
[5222,'N','720から継続運転'],
[1424,'T+LL',''],
[324,'E231(K/E233(E0','東京経由'],
[5426,'N+SS',''],
[120,'LL',''],
[722,'GG+GG',''],
[5326,'E231(K/E233(E0','東京経由'],
[5226,'V',''],
[2228,'V+SS','冬期は逆組成'],
[420,'T+LL','後3両静岡発'],
[328,'E231(U500/E233(U600','東京経由'],
[724,'T+LL',''],
[5726,'T+LL',''],
[1428,'373(F+373(F',''],
[4430,'GG+SS',''],
[728,'T+LL',''],
[730,'T+LL/S',''],
[920,'T+LL',''],
[330,'E231(K/E233(E0',''],
[422,'T+LL',''],
[5732,'N+SS',''],
[5734,'LL/S+SS',''],
[736,'LL/S+SS',''],
[1434,'GG+SS',''],
[5424,'W+SS',''],
[5922,'T+LL/S','後3両浜松発'],
[4001,'373(F','ふじかわ1号'],
[124,'T+LL/S',''],
[738,'T+LL',''],
[1436,'LL/S+SS',''],
[2232,'W+V','御殿場線経由｜後2両沼津止'],
[926,'LL+W','後2両静岡止'],
[426,'N+GG','後2両静岡止'],
[928,'LL/S+SS',''],
[234,'LL',''],
[740,'LL',''],
[742,'T+LL',''],
[1438,'LL/S+SS',''],
[1440,'T',''],
[5744,'T',''],
[746,'T+GG','後2両静岡止'],
[4003,'373(F','ふじかわ3号'],
[748,'GG+T',''],
[1442,'GG+LL',''],
[750,'LL/S+GG',''],
[126,'T',''],
[128,'N',''],
[752,'V+SS',''],
[1444,'LL/S+SS',''],
[5754,'T',''],
[5932,'T+LL',''],
[428,'LL',''],
[756,'T',''],
[760,'T+LL',''],
[1446,'SS',''],
[758,'LL',''],
[762,'W+GG',''],
[130,'LL',''],
[764,'SS',''],
[236,'T',''],
[1448,'LL/S+SS',''],
[766,'GG+GG',''],
[768,'T+LL','後3両静岡止'],
[770,'N+SS','後3両静岡止'],
[4005,'373(F','ふじかわ5号'],
[5132,'W+SS',''],
[1450,'SS',''],
[772,'Y0/J0',''],
[774,'LL/S',''],
[430,'T',''],
[1452,'LL',''],
[776,'T',''],
[136,'SS',''],
[778,'SS',''],
[238,'V',''],
[1454,'LL/S+SS',''],
[5780,'LL+T','後3両静岡止'],
[432,'W+SS','前2両沼津発'],
[782,'SS',''],
[784,'T',''],
[786,'LL',''],
[138,'T',''],
[788,'T',''],
[1456,'T',''],
[790,'N','沼津から2554'],
[240,'SS',''],
[792,'LL',''],
[4007,'373(F','ふじかわ7号'],
[434,'T+GG','後2両沼津発'],
[242,'SS',''],
[5794,'T',''],
[796,'T',''],
[140,'N+T',''],
[436,'T+LL',''],
[798,'LL',''],
[142,'LL/S+GG',''],
[438,'T',''],
[244,'W',''],
[820,'SS',''],
[144,'SS',''],
[1458,'LL+W',''],
[822,'Y0/J0',''],
[824,'N',''],
[440,'GG+SS',''],
[826,'LL/S',''],
[1460,'T+LL',''],
[246,'T+LL',''],
[442,'T+LL',''],
[828,'LL',''],
[4009,'373(F','ふじかわ9号'],
[832,'T',''],
[830,'LL',''],
[834,'LL',''],
[1462,'LL/S+SS',''],
[248,'T',''],
[146,'LL+GG','後2両静岡発'],
[444,'T+LL','後3両静岡発'],
[446,'LL/S+SS',''],
[836,'T+LL',''],
[448,'N+SS','後3両静岡発'],
[838,'T+LL',''],
[332,'E231(K/E233(E0','東京経由'],
[148,'T',''],
[976,'Y0/J0',''],
[450,'T+LL',''],
[2250,'N','御殿場線経由'],
[452,'LL/S+GG',''],
[4011,'373(F','ふじかわ11号'],
[5454,'T+LL',''],
[334,'E231(U500/E233(U600','東京経由'],
[456,'GG+SS',''],
[840,'GG+T','前2両静岡発'],
[984,'LL+W',''],
[842,'N',''],
[458,'LL/S+SS',''],
[2252,'W+V','御殿場線経由｜後2両沼津発'],
[5460,'W+SS',''],
[844,'T+LL',''],
[150,'GG+SS',''],
[990,'Y0/J0',''],
[462,'T+GG',''],
[846,'V+SS',''],
[336,'E231(U500/E233(U600','東京経由'],
[4013,'373(F','ふじかわ13号'],
[848,'T+LL',''],
[850,'LL+GG',''],
[852,'T+LL',''],
[1464,'T+LL/S',''],
[854,'LL+W',''],
[464,'T+LL',''],
[856,'GG+LL/S',''],
[858,'W+W',''],
[154,'LL/S+GG',''],
[860,'T+LL',''],
[1466,'GG+SS',''],
[862,'T+LL',''],
[864,'T+N',''],
[866,'T+LL',''],
[2868,'V+SS',''],
[870,'T+GG',''],
[158,'N+SS',''],
[872,'T+LL',''],
[874,'N+GG',''],
[876,'T+LL',''],
[878,'T+LL',''],
[880,'LL/S+GG',''],
[882,'Y0/J0',''],
[884,'N+SS',''],
[886,'T+LL','土休前日は島田から8888M'],
[8888,'T+LL','土休前日運転'],
[890,'LL/S+SS',''],
[892,'Y0/J0',''],
]




var targetDate = 886;


var target = data.filter( e => e[0] === targetDate );
var t =String(target);
var t1 = t.indexOf(",");
var t2 = t.lastIndexOf(",");
var te1 = t.slice(t1+1,t2);
var te2 = t.slice(t2+1);

  


  
  
  
  
  
  
  var now = new Date();var target = document.getElementById("DateTimeDisp");var Hour = now.getHours();var Min = now.getMinutes();
  
  if(String(Min).length==1){
    var Min = "0"+Min
  }
 var c=0;　　　
document.querySelector('span').innerHTML = "<br>"+Hour+":"+Min;
Object.keys(arr).forEach( function(value) {

  
var n =Number(String(Hour)+String(Min));
  
if(n <= value&&value<n+400){
  
  if( c % 2 === 0 ) {
  var cl = "ki";
}else{
  var cl = "gu"
}
  c++;
  var v = value.slice( 0, value.length-2 )+':' +value.slice(-2) ;
  
var target = data.filter( e => e[0] === this[value] );
var t =String(target);
var t1 = t.indexOf(",");
var t2 = t.lastIndexOf(",");
var te1 = t.slice(t1+1,t2);
var te2 = t.slice(t2+1);
  
   document.querySelector('table').innerHTML+= '<tr><td class="'+cl+'">'+ v + '</td><td class="'+cl+'">' + this[value] +'M</td><td class="'+cl+'">'+te1+'</td><td class="'+cl+'">'+te2+'</td></tr>';
}
}, arr)
  
}
