  aaa();  
setInterval(function(){
      
        aaa();
    },1000)
function aaa(){
document.querySelector('table').innerHTML= '<tr><td class="he">時刻</td><td class="he">列番</td><td class="he">行き先</td><td class="he">運用</td><td class="he">備考</td> </tr>'
  
var data = [
  [1420,'熱海','T+GG',''],
[5422,'熱海','N+SS',''],
[5320,'上野','E231(K/E233(E0','東京経由'],
[720,'沼津','N','沼津から5222'],
[322,'宇都宮','E231(K/E233(E0','東京経由'],
[5222,'三島','N','720から継続運転'],
[1424,'熱海','T+LL',''],
[324,'上野','E231(K/E233(E0','東京経由'],
[5426,'熱海','N+SS',''],
[120,'静岡','LL',''],
[722,'三島','GG+GG',''],
[5326,'宇都宮','E231(K/E233(E0','東京経由'],
[5226,'御殿場','V',''],
[2228,'三島','V+SS','冬期は逆組成'],
[420,'熱海','T+LL','後3両静岡発'],
[328,'小金井','E231(U500/E233(U600','東京経由'],
[724,'三島','T+LL',''],
[5726,'静岡','T+LL',''],
[1428,'熱海','F+F',''],
[4430,'熱海','GG+SS',''],
[728,'三島','T+LL',''],
[730,'静岡','T+LL/S',''],
[920,'沼津','T+LL',''],
[330,'小田原','E231(K/E233(E0',''],
[422,'熱海','T+LL',''],
[5732,'静岡','N+SS',''],
[5734,'三島','LL/S+SS',''],
[736,'沼津','LL/S+SS',''],
[1434,'熱海','GG+SS',''],
[5424,'熱海','W+SS',''],
[5922,'静岡','T+LL/S','後3両浜松発'],
[4001,'甲府','F','ふじかわ1号'],
[124,'興津','T+LL/S',''],
[738,'沼津','T+LL',''],
[1436,'熱海','LL/S+SS',''],
[2232,'三島','W+V','御殿場線経由｜後2両沼津止'],
[926,'興津','LL+W','後2両静岡止'],
[426,'熱海','N+GG','後2両静岡止'],
[928,'熱海','LL/S+SS',''],
[234,'三島','LL',''],
[740,'興津','LL',''],
[742,'沼津','T+LL',''],
[1438,'熱海','LL/S+SS',''],
[1440,'熱海','T',''],
[5744,'三島','T',''],
[746,'興津','T+GG','後2両静岡止'],
[4003,'甲府','F','ふじかわ3号'],
[748,'沼津','GG+T',''],
[1442,'熱海','GG+LL',''],
[750,'静岡','LL/S+GG',''],
[126,'興津','T',''],
[128,'静岡','N',''],
[752,'三島','V+SS',''],
[1444,'熱海','LL/S+SS',''],
[5754,'掛川','T',''],
[5932,'興津','T+LL',''],
[428,'熱海','LL',''],
[756,'興津','T',''],
[760,'三島','T+LL',''],
[1446,'熱海','SS',''],
[758,'掛川','LL',''],
[762,'静岡','W+GG',''],
[130,'興津','LL',''],
[764,'沼津','SS',''],
[236,'三島','T',''],
[1448,'熱海','LL/S+SS',''],
[766,'興津','GG+GG',''],
[768,'三島','T+LL','後3両静岡止'],
[770,'興津','N+SS','後3両静岡止'],
[4005,'甲府','F','ふじかわ5号'],
[5132,'静岡','W+SS',''],
[1450,'熱海','SS',''],
[772,'掛川','Y0/J0',''],
[774,'興津','LL/S',''],
[430,'熱海','T',''],
[1452,'熱海','LL',''],
[776,'興津','T',''],
[136,'静岡','SS',''],
[778,'三島','SS',''],
[238,'沼津','V',''],
[1454,'熱海','LL/S+SS',''],
[5780,'興津','LL+T','後3両静岡止'],
[432,'熱海','W+SS','前2両沼津発'],
[782,'掛川','SS',''],
[784,'興津','T',''],
[786,'三島','LL',''],
[138,'興津','T',''],
[788,'静岡','T',''],
[1456,'熱海','T',''],
[790,'沼津','N','沼津から2554'],
[240,'三島','SS',''],
[792,'興津','LL',''],
[4007,'甲府','F','ふじかわ7号'],
[434,'熱海','T+GG','後2両沼津発'],
[242,'三島','SS',''],
[5794,'掛川','T',''],
[796,'静岡','T',''],
[140,'興津','N+T',''],
[436,'熱海','T+LL',''],
[798,'静岡','LL',''],
[142,'興津','LL/S+GG',''],
[438,'熱海','T',''],
[244,'三島','W',''],
[820,'興津','SS',''],
[144,'静岡','SS',''],
[1458,'熱海','LL+W',''],
[822,'掛川','Y0/J0',''],
[824,'興津','N',''],
[440,'熱海','GG+SS',''],
[826,'静岡','LL/S',''],
[1460,'熱海','T+LL',''],
[246,'三島','T+LL',''],
[442,'熱海','T+LL',''],
[828,'興津','LL',''],
[4009,'甲府','F','ふじかわ9号'],
[832,'三島','T',''],
[830,'掛川','LL',''],
[834,'静岡','LL',''],
[1462,'熱海','LL/S+SS',''],
[248,'三島','T',''],
[146,'興津','LL+GG','後2両静岡発'],
[444,'熱海','T+LL','後3両静岡発'],
[446,'熱海','LL/S+SS',''],
[836,'興津','T+LL',''],
[448,'熱海','N+SS','後3両静岡発'],
[838,'沼津','T+LL',''],
[332,'宇都宮','E231(K/E233(E0','東京経由'],
[148,'静岡','T',''],
[976,'掛川','Y0/J0',''],
[450,'熱海','T+LL',''],
[2250,'三島','N','御殿場線経由'],
[452,'熱海','LL/S+GG',''],
[4011,'甲府','F','ふじかわ11号'],
[5454,'熱海','T+LL',''],
[334,'小金井','E231(U500/E233(U600','東京経由'],
[456,'熱海','GG+SS',''],
[840,'沼津','GG+T','前2両静岡発'],
[984,'掛川','LL+W',''],
[842,'静岡','N',''],
[458,'熱海','LL/S+SS',''],
[2252,'三島','W+V','御殿場線経由｜後2両沼津発'],
[5460,'熱海','W+SS',''],
[844,'三島','T+LL',''],
[150,'静岡','GG+SS',''],
[990,'掛川','Y0/J0',''],
[462,'熱海','T+GG',''],
[846,'三島','V+SS',''],
[336,'宇都宮','E231(U500/E233(U600','東京経由'],
[4013,'甲府','F','ふじかわ13号'],
[848,'興津','T+LL',''],
[850,'静岡','LL+GG',''],
[852,'静岡','T+LL',''],
[1464,'熱海','T+LL/S',''],
[854,'三島','LL+W',''],
[464,'熱海','T+LL',''],
[856,'静岡','GG+LL/S',''],
[858,'三島','W+W',''],
[154,'興津','LL/S+GG',''],
[860,'静岡','T+LL',''],
[1466,'熱海','GG+SS',''],
[862,'掛川','T+LL',''],
[864,'三島','T+N',''],
[866,'静岡','T+LL',''],
[2868,'御殿場','V+SS',''],
[870,'三島','T+GG',''],
[158,'興津','N+SS',''],
[872,'静岡','T+LL',''],
[874,'三島','N+GG',''],
[876,'静岡','T+LL',''],
[878,'静岡','T+LL',''],
[880,'沼津','LL/S+GG',''],
[882,'静岡','Y0/J0',''],
[884,'沼津','N+SS',''],
[886,'島田','T+LL','土休前日は島田から8888'],
[8888,'静岡','T+LL','土休前日運転'],
[890,'掛川','LL/S+SS',''],
[892,'菊川','Y0/J0',''],
]






  


  
  
  
  
  
  
  var now = new Date();var target = document.getElementById("DateTimeDisp");var Hour = now.getHours();var Min = now.getMinutes();
  
  if(String(Min).length==1){
    var Min = "0"+Min
  }
 var c=0;　　　
document.querySelector('span').innerHTML = "<br>"+Hour+":"+Min;
Object.keys(arr).forEach( function(value) {

  
var n =Number(String(Hour)+String(Min));
  
if(n <= value&&value<n+400){
  
  if( c % 2 === 0 ) {
  var cl = "ki";
}else{
  var cl = "gu"
}
  c++;
  var v = value.slice( 0, value.length-2 )+':' +value.slice(-2) ;
  
var target = data.filter( e => e[0] === this[value] );
var t =String(target);
var t1 = t.indexOf(",");
var t2 = t.indexOf(",",5)
var t3 = t.lastIndexOf(",");
var te1 = t.slice(t1+1,t2);
var te2 =   t.slice(t2+1,t3);
var te3 = t.slice(t3+1);
  
   document.querySelector('table').innerHTML+= '<tr><td class="'+cl+'">'+ v + '</td><td class="'+cl+'">' + this[value] +'M</td><td class="'+cl+'">'+te1+'</td><td class="'+cl+'">'+te2+'</td><td class="'+cl+'">'+te3+'</td></tr>';
}
}, arr)
  
}
